In [1]:
import pandas as pd

## Series (One D array)

In [4]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

## Create Series (list, numpy array, dictionary)

### Using List

In [7]:
lis=[1,2,3,4]
pd.Series(data=lis)

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
labels=['a','b','c','d']
pd.Series(data=lis,index=labels)

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
# need not to give full name only values can be work without arguments name.
pd.Series(lis,labels)

a    1
b    2
c    3
d    4
dtype: int64

### Numpy Array

In [21]:
import numpy as np
arr = np.array([10,20,30,50])
pd.Series(arr)

0    10
1    20
2    30
3    50
dtype: int32

In [23]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    50
dtype: int32

### Dictionary

In [25]:
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

## Indexing and Operations

In [34]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])
print(ser1 , " \n")
print("Another series data", " \n")
print(ser2)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

Another series data

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [40]:
print(ser1['USSR'])
print(ser2['Italy'])
print([ser1[1]])
print([ser2[2]])

3
5
[2]
[5]

In [42]:
# Same index name in both series are added only if missing in any one then NaN
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrame (Two D array)

In [45]:
from numpy.random import randn
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
# First give array size, then index and column values
# seed so that we get everytime same value when we run randn
np.random.seed(101)
df1 = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
# Using bunch of Series to create a Dictionary
ser1 = pd.Series( ['USA', 'Germany','USSR', 'korea'])
ser2 = pd.Series( ['israel', 'france','Italy', 'malaysia'])
ser3 = pd.Series( ['germany', 'singapore','USSR', 'india'])
ser4 = pd.Series( ['dubai', 'brazil','India', 'Japan'])
frame={'w':ser1,'x':ser2,'y':ser3,'z':ser4}
df2=pd.DataFrame(frame)
df2

         w         x          y       z
0      USA    israel    germany   dubai
1  Germany    france  singapore  brazil
2     USSR     Italy       USSR   India
3    korea  malaysia      india   Japan

In [65]:
# Indexing Column Wise
df[['w','z']]

         w       z
0      USA   dubai
1  Germany  brazil
2     USSR   India
3    korea   Japan

In [67]:
df['y']

0      germany
1    singapore
2         USSR
3        india
Name: y, dtype: object

In [69]:
df.x

0      israel
1      france
2       Italy
3    malaysia
Name: x, dtype: object

In [88]:
# Add new column
df1['new']=df1['W']+ df1['Z']
df1

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [89]:
# Drop any column axis=1 & row axis=0
df1.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
df1

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [91]:
# to modify the main table and so not to loose the data
df1.drop('new',axis=1,inplace=True)
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [93]:
# need not to write axis =0 as it is deault
df1.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [95]:
# loc is used to indexing row wise and iloc gives the index of the row 
df1.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [97]:
# index 3 means 'D' is here
df1.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [100]:
df1.loc[['A','C'],['X','Y']]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813

In [102]:
df1>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [105]:
df1[df1>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
newind = 'CA NY WY OR CO'.split()
df1['States'] = newind
df1

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [112]:
df1.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Inspecting data  (head, tail, describe)

In [126]:
# Create a dataframe
random = np.random.randn(6,4)
np.random.seed(101)
df = pd.DataFrame(random,
                  index=['p','q','r','x','y','z'],
                  columns=list('ABCD'))
df

          A         B         C         D
p -0.547260  0.496727 -1.235614 -0.798428
q  0.754121 -0.772041 -0.034432  0.688408
r  0.081523 -0.415191  0.053661 -2.115113
x -0.279510  1.062710  1.752014  0.695547
y  0.153661  0.167638 -0.765930  0.962299
z  0.902826 -0.537909 -1.549671  0.435253

In [127]:
# Head(3) gives the first 3 rows.
df.head(3)

          A         B         C         D
p -0.547260  0.496727 -1.235614 -0.798428
q  0.754121 -0.772041 -0.034432  0.688408
r  0.081523 -0.415191  0.053661 -2.115113

In [128]:
# Tail(3) gives the last 3 rows.
df.tail(3)

          A         B         C         D
x -0.279510  1.062710  1.752014  0.695547
y  0.153661  0.167638 -0.765930  0.962299
z  0.902826 -0.537909 -1.549671  0.435253

In [129]:
# Describe gives the statistical values of the data.
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.177560  0.000322 -0.296662 -0.022006
std    0.566128  0.701708  1.188313  1.198452
min   -0.547260 -0.772041 -1.549671 -2.115113
25%   -0.189252 -0.507230 -1.118193 -0.490008
50%    0.117592 -0.123776 -0.400181  0.561831
75%    0.604006  0.414455  0.031638  0.693762
max    0.902826  1.062710  1.752014  0.962299

## Missing data (NULL Values)

In [131]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [134]:
# default axis=0 = row wise
df.dropna()

     A    B  C
0  1.0  5.0  1

In [137]:
# axis=1 , column wise
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [143]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [188]:
df.fillna(value='Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [190]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [97]:
#  Find Null Values or Check for Null Values
import numpy as np
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def',np.nan,'xyz']})
print(df2)
print('---------------Check Null--------------')
print(df2['col3'].isnull())

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  NaN
3     4   444  xyz
---------------Check Null--------------
0    False
1    False
2     True
3    False
Name: col3, dtype: bool

## GroupBY

In [2]:
# Create dataframe
import pandas as pd
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [8]:
df_company=df.groupby("Company")
print(df_company.mean())

# OR Another way of writing

df_company2=df.groupby("Company").mean()
print(df_company2)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [12]:
print("-------------- STD--------------")
print(df_company.std())
print("-------------- MIN--------------")
print(df_company.min())
print("-------------- MAX--------------")
print(df_company.max())
print("-------------- COUNT--------------")
print(df_company.count())

-------------- STD--------------
              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065
-------------- MIN--------------
          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124
-------------- MAX--------------
          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340
-------------- COUNT--------------
         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
print("-------------- describe--------------")
print(df_company.describe())

-------------- describe--------------
        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
print("-------------- describe Transpose--------------")
print(df_company.describe().transpose())

-------------- describe Transpose--------------
Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [22]:
print("-------------- describe Google--------------")
print(df_company.describe().transpose()['GOOG'])

-------------- describe Google--------------
Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Combining DataFrame (Merging, Joining, Concatenate)

In [24]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
print("----------------------------DF1-------------------------")
print(df1)
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
print("----------------------------DF2-------------------------")
print(df2)
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
print("----------------------------DF3-------------------------")
print(df3)

----------------------------DF1-------------------------
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
----------------------------DF2-------------------------
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
----------------------------DF3-------------------------
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [26]:
# Concatenate the dataframes
# Default Row wise
print("----------------------------row-wise----------------------------")
print(pd.concat([df1,df2,df3]))
print("----------------------------column-wise-------------------------")
print(pd.concat([df1,df2,df3],axis=1))

----------------------------row-wise----------------------------
      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
----------------------------column-wise-------------------------
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [32]:
# Merging or SQL Joins
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K4', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
print("----------------------------DF1-------------------------")
print(df1)
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    
print("----------------------------DF2-------------------------")
print(df2)
print("---------------------------inner-------------------------")
print(pd.merge(df1,df2,how='inner',on='key'))
print("---------------------------outer-------------------------")
print(pd.merge(df1,df2,how='outer',on='key'))
print("---------------------------left-------------------------")
print(pd.merge(df1,df2,how='left',on='key'))
print("---------------------------right-------------------------")
print(pd.merge(df1,df2,how='right',on='key'))

----------------------------DF1-------------------------
  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K4  A2  B2
3  K3  A3  B3
----------------------------DF2-------------------------
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
---------------------------inner-------------------------
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C3  D3
---------------------------outer-------------------------
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K4   A2   B2  NaN  NaN
3  K3   A3   B3   C3   D3
4  K2  NaN  NaN   C2   D2
---------------------------left-------------------------
  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K4  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3
---------------------------right-------------------------
  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C3  D3
3  K2  NaN  NaN  C2  D2

In [36]:
# JOINING
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 
print("---------------------------left-------------------------")
print(left)
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
print("---------------------------right-------------------------")
print(right)
print("---------------------------join-------------------------")
print(left.join(right))
print("--------------------------outer join---------------------")
print(left.join(right, how='outer'))

---------------------------left-------------------------
     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
---------------------------right-------------------------
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3
---------------------------join-------------------------
     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
--------------------------outer join---------------------
      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations & Manipulation  (Unique, count, function, selection, length, sum)

In [46]:
# Unique values, Nunique, Count
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df.head())
print(" Unique values:       ",df['col2'].unique())
print(" No of unique values: ",df['col2'].nunique())
print("Count Values:\n",df['col2'].value_counts())

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
 Unique values:        [444 555 666]
 No of unique values:  3
Count Values:
 444    2
555    1
666    1
Name: col2, dtype: int64

In [50]:
# Selection
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
print(df)
print("----------------------Selection--------------------")
print(newdf)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
----------------------Selection--------------------
   col1  col2 col3
3     4   444  xyz

In [53]:
# Applying Functions
def times2(x):
    return x*2
print(df)
print("----------------------function--------------------")
print(df['col1'].apply(times2))
print("----------------------length----------------------")
print(df['col3'].apply(len))
print("----------------------Sum--------------------")
print(df['col1'].sum())

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
----------------------function--------------------
0    2
1    4
2    6
3    8
Name: col1, dtype: int64
----------------------length----------------------
0    3
1    3
2    3
3    3
Name: col3, dtype: int64
----------------------Sum--------------------
10

In [60]:
# ** Permanently Removing a Column**
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(" -----Before----")
print(df)
del df['col1']
print(" -----After----")
print(df)

 -----Before----
   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
 -----After----
   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [67]:
# Sorting
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df)
print("------------------Sort-----------------")
print(df.sort_values(by='col2')) #inplace=False by default

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
------------------Sort-----------------
   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi